{
	"Label": "Room5",
	"Description": "\nYou're now in a room glistening with gold and silver. There's an exit to south, where you came from. There's a big chest of treasure up ahead on a pedestal.\n",
	"Items": [{
		"Name": "Treasure",
		"Description": "With this in hand, you can win the game. Wonder what it is! Probably a fancy hat."
	}],
	"Exits": [
		"south_2"
	],
	"UniqueActions": [{
			"Action": "open chest",
			"Flag": "ChestOpen",
			"Text": "Treasure chest has already been plundered. By you! Good for you!",
			"Consequence": "none"
		},
		{
			"Action": "read chest",
			"Flag": "none",
			"Text": "It says 'Feed me a wallet'. Huh. Weird, right?",
			"Consequence": "none"
		},
		{
			"Action": "talk chest",
			"Flag": "none",
			"Text": "You say hello to the chest and try to strike up a conversation about sports. It does not work. The chest is not amused.",
			"Consequence": "none"
		},
		{
			"Action": "use chest",
			"Flag": "none",
			"Text": "You haphazardly shake the chest. It rattles and clanks a bit, but doesn't do much of note.",
			"Consequence": "none"
		},
		{
			"Action": "use gun",
			"Flag": "none",
			"Text": "The chest gobbles up your gun when it is presented. It snarls at you menacingly. Wanton violence has finally failed to solve a problem!",
			"Consequence": "Lose_Gun"
		},
		{
			"Action": "use wallet",
			"Flag": "none",
			"Text": "The chest gobbles up your wallet when it is presented. Its hunger has subsided it looks like!",
			"Consequence": "Lose_Wallet;ChestHappy"
		},
		{
			"Action": "open chest",
			"Flag": "TreasureGet",
			"Text": "There's a partially digested wallet inside underneath where the treasure was sitting. You should just leave that there.",
			"Consequence": "none"
		},
		{
			"Action": "open chest",
			"Flag": "ChestHappy",
			"Text": "You open up the treasure chest and take out the ambiguous treasure within! Civilization will surely be saved now!\nYou could probably press 'q' to quit the game and exit the dungeon happily now!",
			"Consequence": "Gain_Treasure;TreasureGet"
		},
		{
			"Action": "open chest",
			"Flag": "none",
			"Text": "As you attempt to open the chest, it suddenly opens up and bites you, taking a limb off of you. Whoopsie!",
			"Consequence": "BodyDamage"
		}
	]
}