{
	"Label": "Room4",
	"Description": "\nSmaller chamber with only exit to the south. Very dank and mossy, probably used to be a jail cell or something like that. There is a skellyman on the ground holding a big key.\n",
	"Items": [{
		"Name": "Key",
		"Description": "It probably unlocks something! That's generally how keys work!"
	}],
	"Exits": [
		"south_3"
	],
	"UniqueActions": [{
			"Action": "get key",
			"Flag": "none",
			"Text": "You pry the key out of the skellyman's hands. 'Oh no... Mr. Key... my only friend...' the skellyman softly sobs.",
			"Consequence": "Gain_Key;KeyGet"
		},
		{
			"Action": "eat popcorn",
			"Flag": "SkellyDead",
			"Text": "You eat the caramel popcorn. It tastes alright at first, but then your throat starts to itch. The itching changes to a burning sensation. You look down and see your skin beginning to melt away, leaving nothing but bones behind! UH OH!",
			"Consequence": "PlayerDeadCaramel"
		},
		{
			"Action": "use gun",
			"Flag": "ShotSkelly2",
			"Text": "You shoot the skellyman again, this time in the skull. His head disintegrates, but a pile of caramel popcorn is revealed inside!",
			"Consequence": "SkellyDead;Add_Popcorn"
		},
		{
			"Action": "use gun",
			"Flag": "ShotSkellyman",
			"Text": "You shoot the skellyman again. 'Now you're just being rude.'",
			"Consequence": "ShotSkelly2"
		},
		{
			"Action": "use gun",
			"Flag": "none",
			"Text": "You shoot the skellyman. 'I get that I might be scary looking, but I'm literally already dead and cannot move. That being said, that bullet did just disintegrate a rib, so... ouch?'",
			"Consequence": "ShotSkellyman"
		},
		{
			"Action": "read skellyman",
			"Flag": "none",
			"Text": "You get a good look at the skellyman. He is a puzzle wrapped inside of an enigma. You're not figuring him out anytime soon!",
			"Consequence": "none"
		},
		{
			"Action": "talk skellyman",
			"Flag": "KeyGet",
			"Text": "The skellyman says 'You stole my only friend... Mr. Key... *sob*'",
			"Consequence": "none"
		},
		{
			"Action": "talk skellyman",
			"Flag": "SkellyTalk",
			"Text": "The skellyman says 'Don't mind me. I'll just be here forever. See ya!'",
			"Consequence": "none"
		},
		{
			"Action": "talk skellyman",
			"Flag": "none",
			"Text": "The skellyman says 'Oh neat, you killed that dinosaur huh? Finally I can get out of here... or at least I could if I were still alive. Ah well! Life's a beach!'",
			"Consequence": "SkellyTalk"
		}
	]
}